# Создать строку равную предпоследнему символу введенной строки.


user_str = input()
new_str = user_str[-2]

print(new_str)
