# Создать строку равную первым пяти символам введенной строки.


user_str = input()
new_str = user_str[: 6]

print(new_str)
