#  Дан список целых чисел.
# Создать новый список, каждый элемент которого равен
# исходному элементу умноженному на -2

my_list = [2, 8, 7, 9, 12]

new_list = [(i * -2) for i in my_list]

print(new_list)

