# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
ed_len = 6
cube_v = ed_len ** 3
cube_s = ed_len ** 2
print('Cube volume :', cube_v)
print('Cube area :', cube_s)

