# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a = 63
b = 37
sum = a + b
mult = a * b
sub = a - b
print('Sum :', sum)
print('Multiplication :', mult)
print('Subtraction :', sub)
