# Даны два действительных числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел.
numb_1 = 87
numb_2 = 63
a_mean = (numb_1 + numb_2) / 2
g_mean = (numb_1 * numb_2) ** 0.5
print('Arithmetical mean :', a_mean)
print('Geometric mean :', g_mean)
