# Создать строку равную введенной строке без последних двух символов.


user_str = input()
new_str = user_str[: -2]

print(new_str)
