# Даны действительные числа x и y. Получить |x|-|y|/1+|xy|
x = 5
y = - 45
result = abs(x) - abs(y) / 1 + abs(x * y)
print(int(result))
